In [1]:
import pandas as pd
import numpy as np

In [2]:
df = pd.DataFrame({'First Name': ['Aryan', 'Rohan', 'Riya', 'Yash', 'Siddhant', ],
                   'Last Name': ['Singh', 'Agarwal', 'Shah', 'Bhatia', 'Khanna'],
                   'Type': ['Full-time Employee', 'Intern', 'Full-time Employee', 'Part-time Employee', 'Full-time Employee'],
                   'Department': ['Administration', 'Technical', 'Administration', 'Technical', 'Management'],
                   'YoE': [2, 3, 5, 7, 6],
                   'Salary': [20000, 5000, 10000, 10000, 20000]})

In [3]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 6 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   First Name  5 non-null      object
 1   Last Name   5 non-null      object
 2   Type        5 non-null      object
 3   Department  5 non-null      object
 4   YoE         5 non-null      int64
 5   Salary      5 non-null      int64
dtypes: int64(2), object(4)
memory usage: 368.0+ bytes

In [4]:
df

  First Name Last Name                Type      Department  YoE  Salary
0      Aryan     Singh  Full-time Employee  Administration    2   20000
1      Rohan   Agarwal              Intern       Technical    3    5000
2       Riya      Shah  Full-time Employee  Administration    5   10000
3       Yash    Bhatia  Part-time Employee       Technical    7   10000
4   Siddhant    Khanna  Full-time Employee      Management    6   20000

## Pivot Table

A Pivot Table is used to summarise, sort, reorganise, group, count, total or average data stored in a table.

It allows us to transform columns into rows and rows into columns. 

It allows grouping by any field (column), and using advanced calculations on them.

In [22]:
table = pd.pivot_table(df, values='Salary', columns=['Type'], index='Department', aggfunc=['sum','mean'])

In [23]:
table

                              sum                             \
Type           Full-time Employee  Intern Part-time Employee
Department
Administration            30000.0     NaN                NaN
Management                20000.0     NaN                NaN
Technical                     NaN  5000.0            10000.0

                             mean
Type           Full-time Employee  Intern Part-time Employee
Department
Administration            15000.0     NaN                NaN
Management                20000.0     NaN                NaN
Technical                     NaN  5000.0            10000.0

#### Pass differnt aggfunction to each values

In [7]:
df.pivot_table(values=['Salary', 'YoE'], columns=['Type'], index='Department', aggfunc={'Salary':[np.min,np.max],'YoE':[np.min,np.max]})

                           Salary                             \
                             amax
Type           Full-time Employee  Intern Part-time Employee
Department
Administration            20000.0     NaN                NaN
Management                20000.0     NaN                NaN
Technical                     NaN  5000.0            10000.0

                                                              \
                             amin
Type           Full-time Employee  Intern Part-time Employee
Department
Administration            10000.0     NaN                NaN
Management                20000.0     NaN                NaN
Technical                     NaN  5000.0            10000.0

                              YoE                            \
                             amax
Type           Full-time Employee Intern Part-time Employee
Department
Administration                5.0    NaN                NaN
Management                    6.0    NaN                NaN
Technical                     NaN    3.0                7.0


                             amin
Type           Full-time Employee Intern Part-time Employee
Department
Administration                2.0    NaN                NaN
Management                    6.0    NaN                NaN
Technical                     NaN    3.0                7.0

### User defined aggfunc

In [8]:
# aggfunc must produce aggregated value
def single(Salary):
    return Salary.mean() + 2

def double(Salary, Bonus):
    print(YoE)
    return Salary.mean()+Bonus.mean()

In [9]:
table1 = df.pivot_table(values=['Salary'], columns=['Type'], index='Department', aggfunc=[single])

In [10]:
table1

                           single
                           Salary
Type           Full-time Employee  Intern Part-time Employee
Department
Administration            15002.0     NaN                NaN
Management                20002.0     NaN                NaN
Technical                     NaN  5002.0            10002.0

In [11]:
df2 = df.copy()

In [12]:
df2['Bonus'] = [500,1000,500,2500,1000]

In [13]:
df2.dtypes

First Name    object
Last Name     object
Type          object
Department    object
YoE            int64
Salary         int64
Bonus          int64
dtype: object

In [17]:
df2.Bonus.mean()

1100.0

In [18]:
table2 = df2.pivot_table(values=['Salary', 'Bonus'], columns=['Type'], index='Department', aggfunc=[double])

/tmp/ipykernel_24252/2717625644.py:1: FutureWarning: Dropping invalid columns in DataFrameGroupBy.agg is deprecated. In a future version, a TypeError will be raised. Before calling .agg, select only columns which should be valid for the function.
  table2 = df2.pivot_table(values=['Salary', 'Bonus'], columns=['Type'], index='Department', aggfunc=[double])

TypeError: double() missing 1 required positional argument: 'Bonus'

In [19]:
table2

NameError: name 'table2' is not defined